Documents/ОтражениеДвиженийОСВРегистрахУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ОтражениеДвиженийОСВРегистрахУчетаОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.МестонахождениеОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ЛьготныеОсновныеСредства</xr:Item>
				<xr:Item>InformationRegister.СобытияОСОрганизацийБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.СостоянияОСОрганизацийБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.СчетаБухгалтерскогоУчетаОС</xr:Item>
				<xr:Item>InformationRegister.ЛизинговыеОсновныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсходногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МестонахождениеОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МОЛ</Name>
							<Comment>Выбирается из списка регистра сведений "Работники организаций"</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местонахождение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачислениеАмортизацииОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислятьАмортизацию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыАмортизацииОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьДляВычисленияАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПервоначальныеСведенияОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПоступления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПоступленияАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособНачисленияАмортизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокПогашенияСтоимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокПогашенияСтоимостиОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроизводственнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизводственныеГруппыОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПротивопожарныеОС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаОборудования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСПоОхранеОкружающейСреды</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаОС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ГруппыОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СобытияОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СостояниеОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСостояния</Name>
							<Comment>Дата установки состояния</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпособыОтраженияРасходовПоАмортизацииОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособыОтраженияРасходовПоАмортизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШифрПроизводственныхЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШифрыПроизводственныхЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаБухгалтерскогоУчетаОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНачисленияАмортизации</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛьготныеОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/МестонахождениеОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеОСБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений "Работники организаций"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестонахождениеОСДляГНИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестоНахождениеОбъекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НачислениеАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НачислениеАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает когда начислять амортизацию по бух. учету</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректирующийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработкиОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияОСОрганизацийБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОСОрганизацийБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение состояний основных по бух. учету ОС. Данные вносятся только документами. По этому регистру ведется анализ даты принятия к учету, ввода в эксплуатацию, выбытия.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Comment>Дата установки состояния</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОтражениеДвиженийОСВРегистрахУчетаОС/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаМестонахождениеОС Из МестонахождениеОС Цикл
		// регистр МестонахождениеОСБухгалтерскийУчет 
		Движение = Движения.МестонахождениеОСБухгалтерскийУчет.Добавить();
		Движение.Период = Дата;
		Движение.ОсновноеСредство = ТекСтрокаМестонахождениеОС.ОсновноеСредство;
		Движение.Организация = Организация;
		Движение.МОЛ = ТекСтрокаМестонахождениеОС.МОЛ;
		Движение.Местонахождение = ТекСтрокаМестонахождениеОС.Местонахождение;
	КонецЦикла;
	Для Каждого ТекСтрокаНачислениеАмортизацииОС Из НачислениеАмортизацииОС Цикл
		// регистр НачислениеАмортизацииОСБухгалтерскийУчет 
		Движение = Движения.НачислениеАмортизацииОСБухгалтерскийУчет.Добавить();
		Движение.Период = Дата;
		Движение.ОсновноеСредство = ТекСтрокаНачислениеАмортизацииОС.ОсновноеСредство;
		Движение.Организация = Организация;
		Движение.НачислятьАмортизацию = ТекСтрокаНачислениеАмортизацииОС.НачислятьАмортизацию;
	КонецЦикла;
	Для Каждого ТекСтрокаПараметрыАмортизацииОС Из ПараметрыАмортизацииОС Цикл
		// регистр ПараметрыАмортизацииОСБухгалтерскийУчет 
		Движение = Движения.ПараметрыАмортизацииОСБухгалтерскийУчет.Добавить();
		Движение.Период = Дата;
		Движение.ОсновноеСредство = ТекСтрокаПараметрыАмортизацииОС.ОсновноеСредство;
		Движение.Организация = Организация;
		Движение.СтоимостьДляВычисленияАмортизации = ТекСтрокаПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации;
		Движение.КоэффициентАмортизации = ТекСтрокаПараметрыАмортизацииОС.КоэффициентАмортизации;
	КонецЦикла;
	Для Каждого ТекСтрокаПервоначальныеСведенияОС Из ПервоначальныеСведенияОС Цикл
		// регистр ПервоначальныеСведенияОСБухгалтерскийУчет 
		Движение = Движения.ПервоначальныеСведенияОСБухгалтерскийУчет.Добавить();
		Движение.Период = Дата;
		Движение.ОсновноеСредство = ТекСтрокаПервоначальныеСведенияОС.ОсновноеСредство;
		Движение.Организация = Организация;
		Движение.СпособПоступления = ТекСтрокаПервоначальныеСведенияОС.СпособПоступления;
		Движение.ПервоначальнаяСтоимость = ТекСтрокаПервоначальныеСведенияОС.ПервоначальнаяСтоимость;
		Движение.СпособНачисленияАмортизации = ТекСтрокаПервоначальныеСведенияОС.СпособНачисленияАмортизации;
		Движение.ПорядокПогашенияСтоимости = ТекСтрокаПервоначальныеСведенияОС.ПорядокПогашенияСтоимости;
		Движение.ПроизводственнаяГруппа = ТекСтрокаПервоначальныеСведенияОС.ПроизводственнаяГруппа;
		Движение.ПротивопожарныеОС = ТекСтрокаПервоначальныеСведенияОС.ПротивопожарныеОС;
		Движение.Состояние = ТекСтрокаПервоначальныеСведенияОС.Состояние;
		Движение.ГруппаОборудования = ТекСтрокаПервоначальныеСведенияОС.ГруппаОборудования;
		Движение.ОСПоОхранеОкружающейСреды = ТекСтрокаПервоначальныеСведенияОС.ОСПоОхранеОкружающейСреды;
		Движение.ГруппаОС = ТекСтрокаПервоначальныеСведенияОС.ГруппаОС;
	КонецЦикла;
	Для Каждого ТекСтрокаСобытияОС Из СобытияОС Цикл
		// регистр СобытияОСОрганизацийБухгалтерскийУчет 
		Движение = Движения.СобытияОСОрганизацийБухгалтерскийУчет.Добавить();
		Движение.Период = Дата;
		Движение.ОсновноеСредство = ТекСтрокаСобытияОС.ОсновноеСредство;
		Движение.Организация = Организация;
		Движение.Событие = ТекСтрокаСобытияОС.Событие;
	КонецЦикла;
	Для Каждого ТекСтрокаСостояниеОС Из СостояниеОС Цикл
		// регистр СостоянияОСОрганизацийБухгалтерскийУчет 
		Движение = Движения.СостоянияОСОрганизацийБухгалтерскийУчет.Добавить();
		Движение.ОсновноеСредство = ТекСтрокаСостояниеОС.ОсновноеСредство;
		Движение.Организация = Организация;
		Движение.Состояние = ТекСтрокаСостояниеОС.Состояние;
		Движение.ДатаСостояния = ТекСтрокаСостояниеОС.ДатаСостояния;
	КонецЦикла;
	Для Каждого ТекСтрокаСпособыОтраженияРасходовПоАмортизацииОС Из СпособыОтраженияРасходовПоАмортизацииОС Цикл
		// регистр СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет 
		Движение = Движения.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Добавить();
		Движение.Период = Дата;
		Движение.ОсновноеСредство = ТекСтрокаСпособыОтраженияРасходовПоАмортизацииОС.ОсновноеСредство;
		Движение.Организация = Организация;
		Движение.СпособыОтраженияРасходовПоАмортизации = ТекСтрокаСпособыОтраженияРасходовПоАмортизацииОС.СпособыОтраженияРасходовПоАмортизации;
		Движение.ШифрПроизводственныхЗатрат = ТекСтрокаСпособыОтраженияРасходовПоАмортизацииОС.ШифрПроизводственныхЗатрат;
	КонецЦикла;
	Для Каждого ТекСтрокаСчетаБухгалтерскогоУчетаОС Из СчетаБухгалтерскогоУчетаОС Цикл
		// регистр СчетаБухгалтерскогоУчетаОС 
		Движение = Движения.СчетаБухгалтерскогоУчетаОС.Добавить();
		Движение.Период = Дата;
		Движение.ОсновноеСредство = ТекСтрокаСчетаБухгалтерскогоУчетаОС.ОсновноеСредство;
		Движение.Организация = Организация;
		Движение.СчетУчета = ТекСтрокаСчетаБухгалтерскогоУчетаОС.СчетУчета;
		Движение.СчетНачисленияАмортизации = ТекСтрокаСчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации;
	КонецЦикла;
	Для каждого ТекСтрокаЛьготныеОС Из ЛьготныеОС Цикл
		// регистр ЛьготныеОсновныеСредства 
		Движение = Движения.ЛьготныеОсновныеСредства.Добавить();
		Движение.Период = Дата;
		Движение.ОсновноеСредство = ТекСтрокаЛьготныеОС.ОсновноеСредство;
		Движение.Организация = Организация;
		Движение.Льгота = ТекСтрокаЛьготныеОС.Льгота;
	КонецЦикла; 
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияОСОрганизацийБухгалтерскийУчет.ОсновноеСредство КАК ОсновноеСредство,
	               |	СостоянияОСОрганизацийБухгалтерскийУчет.Состояние КАК Состояние,
	               |	СостоянияОСОрганизацийБухгалтерскийУчет.ДатаСостояния КАК ДатаСостояния
	               |ИЗ
	               |	РегистрСведений.СостоянияОСОрганизацийБухгалтерскийУчет КАК СостоянияОСОрганизацийБухгалтерскийУчет
	               |ГДЕ
	               |	СостоянияОСОрганизацийБухгалтерскийУчет.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("ОсновноеСредство", Выборка.ОсновноеСредство);
		
		РезультатПоиска = СостояниеОС.НайтиСтроки(СтруктураПоиска);
		
		Для каждого ЭлементРезультата Из РезультатПоиска Цикл
			СостояниеОС.Удалить(ЭлементРезультата);
		КонецЦикла; 
		
	КонецЦикла; 
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
